import React from 'react';
import { Link } from 'react-router-dom';
import '../assets/css/index.css';
import firstImage from '../assets/img/img_index/first.svg';
import secondImage from '../assets/img/img_index/second.png';
import thirdImage from '../assets/img/img_index/third.svg';
import fourthImage from '../assets/img/img_index/fourth.svg';

function HomePage() {
  return (
    <div>
      <header>
        <div className="head-logo">
          <div className="logo">
            <i className="bx bx-shield-plus"></i>
            <h4>Helping Hands</h4>
          </div>
        </div>

        <nav>
        <nav>
          <ul>
            <li><Link to="/">Головна</Link></li>
            <li><Link to="/initiatives">Доступні ініціативи</Link></li>
            <li><Link to="/my-initiatives">Мої ініціативи</Link></li>
            <li><Link to="/about">Про нас</Link></li>
            <li className="log_in_m"><Link to="/log_in">Увійти <i className="bx bx-log-in"></i></Link></li>
            </ul>
        </nav>
        </nav>
      </header>

      <main>
        <section className="main-sect">
          <div className="main-sect-text">
            <h2>Ласкаво просимо до Helping Hands</h2>
            <p>
              Ми допомагаємо волонтерам знаходити важливі ініціативи та робити
              світ кращим. Наша платформа дозволяє вам легко долучатися до
              різноманітних соціальних проектів, що потребують допомоги. Знайдіть
              ініціативи в вашому місті або навіть глобальні проекти, що
              потребують волонтерів.
            </p>

            <p>
              Кожен день ти можеш змінювати світ на краще. Наша мета — це
              об'єднати людей, які готові допомагати, з тими, хто потребує
              допомоги. З нами волонтери отримують можливість працювати в команді,
              виконуючи важливі завдання, що змінюють суспільство.
            </p>
            <hr />
          </div>
        </section>

        <section className="about">
          <h4>Це час для вашого соціального проєкту!</h4>
          <p>
            Кожен соціальний проєкт починається з ідеї, кожна ідея – з бажання
            змінити Україну на краще. Якщо у вашому серці зародилась іскра такого
            бажання, не зволікайте. Ваша ідея може стати наступною великою
            ініціативою, яка покращить життя українців та сприятиме розвитку
            нашого суспільства. Ми готові підтримати вас на кожному етапі – від
            планування до реалізації. Ви не одні у цьому прагненні до змін.
            Давайте будувати краще майбутнє разом!
          </p>
          <Link to="/initiatives" className="btn">
            Втілити соціальний проект
          </Link>
        </section>

        <section className="social_proj">
          <article>
            <img src={firstImage} alt="First project" />
            <h3>Розпочати соціальний проект</h3>
            <p>
              Якщо ви маєте соціальну ідею, яка може покращити якість життя
              громад, Створіть проєкт щоб презентувати свою концепцію. Ми
              допоможемо вам ретельно розробити презентаційний опис, який чітко
              висвітлить ключові переваги і цілі вашої ініціативи та оприлюднимо
              його для всієї соціальної спільноти.
            </p>
          </article>
          <article>
            <img src={secondImage} alt="Second project" />
            <h3>Презентувати соціальний проєкт</h3>
            <p>
              Завітайте до нашого Соціального партнера Студія ТОЛОКА щоб
              презентувати суспільству та обговорити вашу ініціативу у прямому
              ефірі. Адже залучення суспільства до обговорення, дозволить зібрати
              зворотній зв’язок, щоб покращити проєкт і зробити його більш
              відповідним до потреб громади.
            </p>
          </article>
          <article>
            <img src={thirdImage} alt="Third project" />
            <h3>Проаналізувати соціальний проєкт</h3>
            <p>
              Після активного розгляду, обговорення та отримання підтримки вашого
              соціального проєкту Прихильниками, ми спільно з вами проаналізуємо
              весь отриманий зворотний зв’язок. Це дозволить нам виявити ключові
              аспекти для покращення та спільно з вами розробити стратегію, яка
              зробить ваш проєкт більш відповідним до потреб і очікувань громади.
            </p>
          </article>
          <article>
            <img src={fourthImage} alt="Fourth project" />
            <h3>Втілити соціальний проєкт</h3>
            <p>
              Це вирішальний момент: ваш проєкт отримав підтримку громади – соціальна
              країна визнала його важливість. Наступний крок – Збір коштів для
              реалізації вашої ідеї. Ми будемо поруч, щоб разом з вами розробити
              професійний план втілення проєкту, від креативного концепту до
              практичного виконання. Це час перетворити вашу ідею в дію, вносячи реальний
              вплив у життя громади.
            </p>
          </article>
        </section>
      </main>

      <footer>
        <p>Приєднуйтесь до нас і станьте частиною змін!</p>

        <p>
          Контакти:
          <a href="mailto:volunteer@initiative.org">volunteer@initiative.org</a> |
          <a href="tel:+380991234567">+380 99 123 45 67</a>
        </p>

        <Link to="#">Політика конфіденційності</Link>
      </footer>
    </div>
  );
}

export default HomePage;
